# LoadCaseName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
LoadBase..::..LoadCaseName Property
LoadBase Class See Also
---
The name of the load case to which this load belongs.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string LoadCaseName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LoadCaseName As String
	Get
```

Visual C++
---
```text
public:
property String^ LoadCaseName {
	String^ get ();
}
```

# See Also
LoadBase Class
Autodesk.Revit.DB.Structure Namespace